INSERT INTO customers (first_name, last_name, phone, email) VALUES
('Иван', 'Иванов', '89001234567', 'ivanov@mail.ru'),
('Мария', 'Козлова', '89007654321', 'm.kozlova@mail.ru'),
('Алексей', 'Смирнов', '89009876543', 'asmirnov@mail.ru'),
('Ольга', 'Петрова', '89003456789', 'opetrova@mail.ru'),
('Дмитрий', 'Лебедев', '89005673412', 'dmitry@mail.ru'),
('Наталья', 'Васильева', '89004321987', 'natasha@mail.ru'),
('Сергей', 'Михайлов', '89006789012', 'sergey@mail.ru'),
('Екатерина', 'Новикова', '89008901234', 'ekaterina@mail.ru'),
('Павел', 'Федоров', '89001239876', 'pavel@mail.ru'),
('Анна', 'Павлова', '89009765432', 'anna@mail.ru'),
('Виктор', 'Орлов', '89006543210', 'viktor@mail.ru'),
('Юлия', 'Романова', '89004321098', 'yulia@mail.ru'),
('Андрей', 'Белов', '89005678901', 'andrey@mail.ru'),
('Татьяна', 'Исаева', '89006789013', 'tanya@mail.ru'),
('Константин', 'Громов', '89007890124', '');

INSERT INTO products (description, price, quantity, category) VALUES
('Смартфон Samsung Galaxy A52', 25000, 10, 'Электроника'),
('Ноутбук ASUS VivoBook', 45000, 5, 'Электроника'),
('Холодильник Samsung RT38', 35000, 3, 'Бытовая техника'),
('Книга "Война и мир"', 1000, 20, 'Книги'),
('Футболка мужская размер L', 800, 50, 'Одежда'),
('Кроссовки Nike Air Max размер 38', 7000, 15, 'Обувь'),
('Детская игрушка "Мягкий мишка"', 1200, 30, 'Игрушки'),
('Блок для йоги Starfit', 500, 8, 'Спорттовары'),
('Стол кухонный', 12000, 4, 'Мебель'),
('Крем для лица "Либридерм"', 850, 25, 'Красота и уход'),
('Автошины Bridgestone', 10000, 6, 'Автозапчасти'),
('Корм для кошек "Whiskas"', 23, 40, 'Зоотовары'),
('Микроволновая печь Samsung', 5000, 7, 'Бытовая техника'),
('Кулон с бриллиантом', 15000, 2, 'Аксессуары');

INSERT INTO order_status (name) VALUES
('Новый'),
('Обрабатывается'),
('Оплачен'),
('Доставляется'),
('Завершен'),
('Отменен');

INSERT INTO "orders" (product_id, customer_id, order_date, quantity, status_id) VALUES
(1, 1, '2025-10-05 10:15:00', 1, 1),
(2, 2, '2025-10-02 11:20:00', 1, 2),
(3, 3, '2025-10-03 09:45:00', 1, 3),
(4, 4, '2025-10-04 14:30:00', 2, 4),
(5, 5, '2025-09-05 16:00:00', 3, 5),
(6, 6, '2025-10-04 13:25:00', 2, 1),
(7, 7, '2025-09-07 12:10:00', 1, 2),
(8, 8, '2025-09-08 15:45:00', 1, 3),
(9, 9, '2025-09-09 17:20:00', 1, 4),
(10, 10, '2025-04-10 10:55:00', 1, 5),
(11, 11, '2025-04-11 09:05:00', 2, 5),
(12, 12, '2025-09-12 11:15:00', 5, 5),
(13, 13, '2025-09-13 14:50:00', 1, 5),
(14, 14, '2025-09-14 16:40:00', 2, 6),
(3, 15, '2025-10-05 12:30:00', 1, 6);
